# Создать образ на основе базового слоя python (там будет ОС и интерпретатор Python).
FROM python:3.10-slim

# Запустить команду создания директории внутри контейнера
RUN mkdir /app

# Скопировать с локального компьютера файл зависимостей
# в директорию /app.
COPY requirements.txt /app

# Выполнить установку зависимостей внутри контейнера.
RUN pip3 install -r /app/requirements.txt --no-cache-dir

# Скопировать содержимое директории /crm c локального компьютера
# в директорию /app.
COPY crm/ /app

# Сделать директорию /app рабочей директорией. 
WORKDIR /app

# Выполнить запуск сервера при старте контейнера.
CMD ["gunicorn", "crm.wsgi:application", "--bind", "0:8000" ]